Tekla Open API Reference for Tekla Structures 2025
ReinforcementSelectionForm Class
 The ReinforcementSelectionForm class represents a dialog to select rebars using the rebar catalogs.
Inheritance Hierarchy
System.Object
 System.MarshalByRefObject
 System.ComponentModel.Component
 System.Windows.Forms.Control
 System.Windows.Forms.ScrollableControl
 System.Windows.Forms.ContainerControl
 System.Windows.Forms.Form
 Tekla.Structures.Dialog.UIControls.ReinforcementSelectionForm
 Namespace: Tekla.Structures.Dialog.UIControls
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public class ReinforcementSelectionForm : Form
Public Class ReinforcementSelectionForm
	Inherits Form
The ReinforcementSelectionForm type exposes the following members.
Constructors
Name | Description
ReinforcementSelectionForm(List<RebarItem>)
 Creates a new instance of the ReinforcementSelectionForm.
ReinforcementSelectionForm(List<RebarItem>, String, String, Double)
 Creates a new instance of the ReinforcementSelectionForm and will select in the tree the rebar that contains the given parameters (if possible).
ReinforcementSelectionForm(List<RebarItem>, String, String, Double, String)
 Creates a new instance of the ReinforcementSelectionForm and will select in the tree the rebar that contains the given parameters (if possible).
Top
Properties
Name | Description
Culture
 Gets the culture.
SelectedBendingRadius
 Gets the selected rebar bending radius.
SelectedGrade
 Gets the selected rebar grade.
SelectedSize
 Gets the selected rebar size.
SelectedUsage
 Gets the selected usage.
Top
See Also
Reference
Tekla.Structures.Dialog.UIControls Namespace